In [2]:
import numpy as np 
import pandas as pd 
from datetime import datetime
import matplotlib.pyplot as plt
import scipy

In [5]:
data = {
'Name': ['Alice', 'Bob', 'Charlie', np.nan, 'Eva'],
'Age': [25, 30, 35, None, 105],
'Email': ['alice@example.com', None, 'charlie@somemail', 'na', 'eva@domain.com'],
'JoinDate': ['2021-01-01', '2020-06-15', None, '2019-07-20', 'NA'],
'Salary': [70000, 50000, None, 0, 150000]
}

df = pd.DataFrame(data)
print("Original DataFrame:")
print(df)

Original DataFrame:
      Name    Age              Email    JoinDate    Salary
0    Alice   25.0  alice@example.com  2021-01-01   70000.0
1      Bob   30.0               None  2020-06-15   50000.0
2  Charlie   35.0   charlie@somemail        None       NaN
3      NaN    NaN                 na  2019-07-20       0.0
4      Eva  105.0     eva@domain.com          NA  150000.0

In [7]:
print(df.isnull().sum())

Name        1
Age         1
Email       1
JoinDate    1
Salary      1
dtype: int64

In [9]:
#Scăparea de rânduri care nu au nume și vârstă
df_cleaned = df.dropna(subset=["Name", "Age"])
df_cleaned

      Name    Age              Email    JoinDate    Salary
0    Alice   25.0  alice@example.com  2021-01-01   70000.0
1      Bob   30.0               None  2020-06-15   50000.0
2  Charlie   35.0   charlie@somemail        None       NaN
4      Eva  105.0     eva@domain.com          NA  150000.0

In [16]:
print(df_cleaned["JoinDate"].value_counts())

JoinDate
2021-01-01    1
2020-06-15    1
Name: count, dtype: int64

In [17]:
df_cleaned["JoinDate"].replace(("NA"), np.nan, inplace = True)

C:\Users\uvang\AppData\Local\Temp\ipykernel_11784\2339133049.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df_cleaned["JoinDate"].replace(("NA"), np.nan, inplace = True)

In [20]:
df_cleaned["joined"] = df_cleaned["JoinDate"].notnull()
df_cleaned

C:\Users\uvang\AppData\Local\Temp\ipykernel_11784\3482696238.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df_cleaned["joined"] = df_cleaned["JoinDate"].notnull()

      Name    Age              Email    JoinDate    Salary  joined
0    Alice   25.0  alice@example.com  2021-01-01   70000.0    True
1      Bob   30.0               None  2020-06-15   50000.0    True
2  Charlie   35.0   charlie@somemail        None       NaN   False
4      Eva  105.0     eva@domain.com         NaN  150000.0   False

In [36]:
data = {"time": pd.date_range(start="2023-01-1", periods = 5), "value":[0.666, 3.266, np.nan, np.nan, 11]}
df_test = pd.DataFrame(data)

df_test["value"]= df_test["value"].interpolate(method="linear")
df_test

        time   value
0 2023-01-01   0.666
1 2023-01-02   3.266
2 2023-01-03   5.844
3 2023-01-04   8.422
4 2023-01-05  11.000

In [37]:
df_test["value"].ffill()

0     0.666
1     3.266
2     5.844
3     8.422
4    11.000
Name: value, dtype: float64